<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Build an unattended version of X-Rite i1Profiler.

    Remove interactive scripts and applications (usually AppleScripts) to allow for unattended installation.

    Normally the i1Profiler mpkg runs loginitem.app to get i1ProfilerTray.app into Login Items. 
    It also launches the tray application during the install. These have been removed as they fail in a non-interactive
    installation.

    OVERRIDES

        NAME - The name used to find the downloaded package that was unpacked from a zip file. This should normally not change.

        PKG_NAME - The name of the package that will be created by this recipe. Defaults to `i1Profiler Silent.pkg`. You may have to override
        this in i1Profiler.munki because FlatPkgPacker does not have output variables.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.pkg.i1Profiler</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>i1Profiler</string>
        <key>PKG_NAME</key>
        <string>i1Profiler Silent.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.i1Profiler</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.pkg</string>
                <key>skip_payload</key>
                <false/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkgroot</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>#!/bin/bash

echo "postinstall script start******"
pwd
ls 
# autopkg: do not run applet to append loginitem
# autopkg: TODO - may need to create a LaunchItem to replace modification of login items
# TODO: only launch app if install is without logout
#echo "Launching the app"
#open /Applications/i1Profiler/i1ProfilerTray.app
echo "Return Code:"
echo $?
echo "postinstall script end******"
</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkgroot/i1ProfilerTrayComponent.pkg/Scripts/postinstall</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/%PKG_NAME%</string>
                <key>source_flatpkg_dir</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkgroot</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
