<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Import X-Rite i1Profiler into your munki repository (Using the unattended package created by i1Profiler.pkg).

    OVERRIDES
        
        NAME - The name of the item in your munki repository, defaults to `i1Profiler`.

        MUNKI_REPO_SUBDIR - The subdirectory of your munki repository where this package will be imported.
        defaults to `apps/XRite`.

        PKG_NAME - The filename of the flat package created by i1Profiler.pkg. Because FlatPkgPacker doesn't have outputs,
        you have to override this on both recipes if you don't want the package name to be `i1Profiler Silent.pkg`

        pkginfo - The default template pkginfo. The hasp installer does not always run (com.xrite.hasp.installer.pkg), therefore 
        by default it must be marked as optional to prevent munki from showing the item as not installed.

    </string>
    <key>Identifier</key>
    <string>com.github.mosen.munki.i1Profiler</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>i1Profiler</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/XRite</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>i1ProfilerTray</string>
                <string>i1Profiler</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>i1Profiler Profile Creation Tool</string>
            <key>display_name</key>
            <string>i1Profiler</string>
            <key>minimum_os_version</key>
            <string>10.6.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.i1Profiler</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.pkg</string>
                <key>skip_payload</key>
                <false/>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkgroot</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkgroot/i1profiler.pkg/Payload</string>
                <key>archive_format</key>
                <string>tar_gzip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/i1profiler_payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/i1profiler_payload/i1Profiler.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
