<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Download the current release of Pantone Color Manager

    You will still need to activate PCM with your PANTONE registration.
    Either by registering your PANTONE color guide or buy purchasing an application license separately.

    If you don't have X-Rite Device Services installed, this package will also install that to support calibration
    via spectrophotometer.

    2015-12-22: Added Static URL to override Sparkle URL because pantone have let the certificate expire on pcm.pantone.com
    2019-02-15: Re-introducing SparkleUpdateInfoProvider because certificate is back in working order, and now points directly to a dmg, which simplifies the Munki recipe

    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.PantoneColorManager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PantoneColorManager</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://pcm.pantone.com/pantonecolormanager/mac/feed/pcm_feed.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/PANTONE Color Manager.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.xrite.pantonecolormanager" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2K7GT73B4R")</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
