<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Download the current release of Pantone Color Manager

    You will still need to activate PCM with your PANTONE registration.
    Either by registering your PANTONE color guide or buy purchasing an application license separately.

    If you don't have X-Rite Device Services installed, this package will also install that to support calibration
    via spectrophotometer.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.PantoneColorManager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PantoneColorManager</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>https://pcm.pantone.com/pantonecolormanager/mac/feed/pcm_feed.xml</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
