<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        Acronis Shadow Connect with Restart package (choice100) disabled via Choices XML
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.munki.ShadowConnect</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ShadowConnect</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>plugins/Acronis</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Acronis ShadowConnect</string>
            <key>display_name</key>
            <string>Acronis ShadowConnect</string>
            <key>minimum_os_version</key>
            <string>10.5.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>installer_choices_xml</key>
            <array>
                <dict>
                    <key>attributeSetting</key>
                    <integer>0</integer>
                    <key>choiceAttribute</key>
                    <string>selected</string>
                    <key>choiceIdentifier</key>
                    <string>choice100</string>
                </dict>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.AcronisConnect</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>        
    </array>
</dict>
</plist>
