<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads latest version of Seafile Client and imports into a Munki repo.</string>

        <key>Identifier</key>
        <string>com.github.mosen.munki.SeafileClient</string>
        
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>SeafileClient</string>

            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps</string>

            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>

                <key>description</key>
                <string>Seafile is an open source cloud storage for your teams and organizations. (Dropbox like)</string>

                <key>display_name</key>
                <string>Seafile</string>

                <key>name</key>
                <string>Seafile</string>
                
                <key>unattended_install</key>
                <false/>
            </dict>
        </dict>
        
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        
        <key>ParentRecipe</key>
        <string>com.github.mosen.download.SeafileClient</string>
        
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>