<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Download the specified version of HotDoor CADTools
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.CADTools9</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CadTools</string>
        <key>VERSION</key>
        <string>9</string>
        <key>DOWNLOAD_PREFIX</key>
        <string>http://hotdoor.com/downloads/HD/CADtools</string>
        <key>DOWNLOAD_SUFFIX</key>
        <string>.dmg.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_PREFIX%%VERSION%%DOWNLOAD_SUFFIX%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
