<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Download the Xerox/EFI Fiery EX550/560 Driver

    The URL is static until i write a scraper.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.FieryEX550_560</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FieryEX550_560</string>
        <key>DOWNLOAD_URL</key>
        <string>http://download.support.xerox.com/pub/drivers/XRIP_550_Fiery/drivers/macosx106/da/XC_EX560_v2_0_R_EFIGSBpDX_FD45_v1.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
