<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Import SaltStack python3 into munki</string>
		<key>Identifier</key>
		<string>com.github.mosen.munki.salt.py3</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>salt-py3</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>support/SaltStack</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>description</key>
				<string>Change the way you build, control and secure complex infrastructure and application environments at scale.</string>
				<key>developer</key>
				<string>SaltStack</string>
				<key>display_name</key>
				<string>SaltStack</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.mosen.download.salt.py3</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
