<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SaltStack, specify python version
in the PYVERSION variable to switch between 2 (default) and 3 versions of the installer.</string>
	<key>Identifier</key>
	<string>com.github.mosen.download.salt</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Salt</string>
		<key>PYVERSION</key>
		<string>2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The Salt Project is no longer building macOS packages (details: https://saltproject.io/blog/streamlining-cicd-package-distribution/). This recipe is deprecated and will be removed in the future.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://repo.saltstack.com/#osx</string>
				<key>re_pattern</key>
				<string>Latest release: ([\d\.]+)</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://repo.saltstack.com/osx/salt-%version%-py%PYVERSION%-x86_64.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Salt Stack, Inc. (VK797BMMY4)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
