<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>
            Downloads the current release version SaltStack.

            Static URL just for now. Should scan Apache index at https://repo.saltstack.com/osx/
        </string>
        <key>Identifier</key>
        <string>com.github.mosen.download.salt</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Salt</string>
            <key>DOWNLOAD_URL</key>
            <string>https://repo.saltstack.com/osx/salt-2016.11.3-x86_64.pkg</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
