<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest python2 version of SaltStack.</string>
	<key>Identifier</key>
	<string>com.github.mosen.download.salt</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Salt</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://repo.saltstack.com/#osx</string>
				<key>re_pattern</key>
				<string>Latest release: ([\d\.]+)</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://repo.saltstack.com/osx/salt-%version%-py2-x86_64.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>