<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Download the Xerox/EFI Fiery EX550/560 Driver
	This version now includes support for ElCapitan 10.11 and all versions below
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.FieryEX550_560_ElCapitan</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FieryEX550_560_ElCapitan</string>
        <key>url</key>
        <string>http://download.support.xerox.com/pub/drivers/550_560_DCP/drivers/macosx1011/en_GB/FIT101142635.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
