<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        Import the Xerox EFI EX550/560 silent install package into munki.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.munki.FieryEX550_560</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FieryEX550_560</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>printers/Xerox</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Installer for the Xerox EFI Fiery EX560 Drivers and Supporting Utilities</string>
            <key>display_name</key>
            <string>Xerox Fiery EX550 560</string>
            <key>minimum_os_version</key>
            <string>10.6.8</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.pkg.FieryEX550_560</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>        
    </array>
</dict>
</plist>
