<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of DataGrip and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.mosen.munki.DataGrip</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/datagrip</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer</string>
		<key>NAME</key>
		<string>DataGrip</string>
		<key>PLATFORM</key>
		<string>mac</string>
		<key>PRODUCT_CODE</key>
		<string>DG</string>
		<key>PRODUCT_IDENTIFIER</key>
		<string>com.jetbrains.datagrip</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Meet DataGrip, our database IDE that is tailored to suit the specific needs of professional SQL developers.</string>
			<key>developer</key>
			<string>JetBrains</string>
			<key>display_name</key>
			<string>DataGrip</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.mosen.download.jetbrains</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>munkiimport_appname</key>
				<string>DataGrip.app</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
