<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest release of PhpStorm and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.mosen.munki.PhpStorm</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PhpStorm</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/JetBrains/PhpStorm</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>PhpStorm</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>PhpStorm is a PHP IDE that actually ‘gets’ your code. It supports PHP 5.3/5.4/5.5/5.6/7.0, provides on-the-fly error prevention, best autocompletion and code refactoring, zero configuration debugging, and an extended HTML, CSS, and JavaScript editor.</string>
			<key>developer</key>
			<string>JetBrains</string>
			<key>display_name</key>
			<string>PhpStorm</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.mosen.download.PhpStorm</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
