<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest release of PyCharm (Professional Edition)</string>
    <key>Identifier</key>
    <string>com.github.mosen.download.PyCharmPro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PyCharmPro</string>
        <key>PLATFORM</key>
        <string>mac</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>JetbrainsURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product</key>
                <string>PyCharm</string>
                <key>product_code</key>
                <string>prof</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
