<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Import the Acrobat XMP Plugin into Munki
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.munki.Esko.AcrobatXMP</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AcrobatXMP</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>plugins/Esko</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Adobe Acrobat</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>PrePress</string>
            <key>description</key>
            <string>Esko XMP Plugin for Acrobat</string>
            <key>developer</key>
            <string>Esko</string>
            <key>display_name</key>
            <string>Esko XMP Plugin for Acrobat</string>
            <key>minimum_os_version</key>
            <string>10.10.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.pkg.Esko.AcrobatXMP</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>        
    </array>
</dict>
</plist>
