<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Modify pre/post scripts to remove reference to AppleScript alert dialogs and use exit status only.
    This will make package installation compatible with a silent workflow.

    You must register to receive the download URL legitimately.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.pkg.EskoCTLP14</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CT-LP</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.EskoCTLP14</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/CT-LP.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/CT-LP.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/CT-LP.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/CT-LP.pkg/Scripts/postinstall</string>
                <key>file_content</key>
                <string>#!/bin/bash
echo "Running: postinstall"
CHECK_RESULT=0
if [ -f ./InstallationCheck ]; then
  echo Running InstallationCheck
  ./InstallationCheck
  CHECK_RESULT=$?
  echo Check result is $CHECK_RESULT
  if [ $CHECK_RESULT -eq 64  ]; then
    echo Skipping package CT-LP
    exit 0
  fi
fi


"/System/Library/CoreServices/FixupResourceForks" -q "/Library/Application Support/Esko-Graphics/DeskPack Plug-In Repository/CT-LP"
./DTPScript -debug1 -c "$TMPDIR" -PS13 "/Library/Application Support/Esko-Graphics/DeskPack Plug-In Repository/CT-LP"
RESULT_PS13="$?"
echo "RESULT_PS13 = $RESULT_PS13"
if [ $RESULT_PS13 = 1 ] || [ $RESULT_PS13 = 3 ] ; then exit 1; fi
if [ $RESULT_PS13 = 4 ]; then exit 1; fi

./DTPScript -debug1 -c "$TMPDIR" -PS14 "/Library/Application Support/Esko-Graphics/DeskPack Plug-In Repository/CT-LP"
RESULT_PS14="$?"
echo "RESULT_PS14 = $RESULT_PS14"
if [ $RESULT_PS14 = 1 ] || [ $RESULT_PS14 = 3 ] ; then exit 1; fi
if [ $RESULT_PS14 = 4 ]; then exit 1; fi

if [ $[RESULT_PS13 * RESULT_PS14] != 0 ]; then
  echo "Photoshop is not available."
  exit 1
fi

echo Creating reciept to "/Library/Receipts/CT-LP.pkg/Contents/Info.plist"
echo CFBundleShortVersionString=14.0.34
mkdir -p "/Library/Receipts/CT-LP.pkg/Contents"
echo '  &lt;key&gt;CFBundleShortVersionString&lt;/key&gt;' > "/Library/Receipts/CT-LP.pkg/Contents/Info.plist"
echo '  &lt;string&gt;14.0.34&lt;/string&gt;' >> "/Library/Receipts/CT-LP.pkg/Contents/Info.plist"



exit 0
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/CT-LP Silent.pkg</string>
                <key>source_flatpkg_dir</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>