<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Modify pre/post scripts to remove reference to AppleScript alert dialogs and use exit status only.
    This will make package installation compatible with a silent workflow.

    You must register to receive the download URL legitimately.

    Version History:
    Esko Data Exchange 14 - Changed from .mpkg distribution to flat .pkg, rewrote recipe.
    Esko Data Exchange 14.0.115 - Removed script modification to Licensing.pkg. It is not longer bundled with Esko Data Exchange.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.pkg.EskoDataExchange</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Esko Data Exchange</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.EskoDataExchange</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Esko Data Exchange.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/Esko Data Exchange.pkg</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/Esko Data Exchange.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot/Esko Data Exchange.pkg/Scripts/EskoDataExchange-postinstall</string>
                <key>file_content</key>
                <string>#!/bin/bash
#!/bin/bash
echo "Running: EskoDataExchange-postinstall"
"/System/Library/CoreServices/FixupResourceForks" -q "/Library/Application Support/Esko-Graphics/DeskPack Plug-In Repository/Esko Data Exchange"
./DTPScript -debug1 -c "$TMPDIR" -AI16 "/Library/Application Support/Esko-Graphics/DeskPack Plug-In Repository/Esko Data Exchange/EskoDataExchange.bundle/Contents/Resources"
RESULT_AI16="$?"
echo "RESULT_AI16 = $RESULT_AI16"
if [ $RESULT_AI16 = 1 ] || [ $RESULT_AI16 = 3 ] ; then exit 1; fi
if [ $RESULT_AI16 = 4 ]; then exit 1; fi

./DTPScript -debug1 -c "$TMPDIR" -AI17 "/Library/Application Support/Esko-Graphics/DeskPack Plug-In Repository/Esko Data Exchange/EskoDataExchange.bundle/Contents/Resources"
RESULT_AI17="$?"
echo "RESULT_AI17 = $RESULT_AI17"
if [ $RESULT_AI17 = 1 ] || [ $RESULT_AI17 = 3 ] ; then exit 1; fi
if [ $RESULT_AI17 = 4 ]; then exit 1; fi

./DTPScript -debug1 -c "$TMPDIR" -AI18 "/Library/Application Support/Esko-Graphics/DeskPack Plug-In Repository/Esko Data Exchange/EskoDataExchange.bundle/Contents/Resources"
RESULT_AI18="$?"
echo "RESULT_AI18 = $RESULT_AI18"
if [ $RESULT_AI18 = 1 ] || [ $RESULT_AI18 = 3 ] ; then exit 1; fi
if [ $RESULT_AI18 = 4 ]; then exit 1; fi

if [ $[RESULT_AI16 * RESULT_AI17 * RESULT_AI18] != 0 ]; then
  echo "Illustrator is not available."
  exit 1
fi

exit 0
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/Esko Data Exchange Silent.pkg</string>
                <key>source_flatpkg_dir</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>