<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Download the current release of Esko Ink Tools [TRIAL]

    You must register with Esko to legitimately receive the download URL
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.Esko.InkTools</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>InkTools</string>
        <key>url</key>
        <string>http://cdn.mysoftware.esko.com/downloads/Public/Trials/Latest/InkToolsTrial_16.0.0.396.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
