<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        This recipe unpacks the Centrify DirectControl package, and modifies it to exclude interactive scripts.
        See "Installing remotely using Apple Remote Desktop" pg. 253 of "Admin Guide For Mac OS X.pdf".
        
        I have not included the option to modify the `userscript` file inside the package to join a domain.
        You can join a domain using your own configuration system, or using Munki's postinstall_script variable.

        To do this, you can edit the CentrifyDC pkginfo file, and add a script containing `adjoin` for example:
            
                #!/bin/sh
                adjoin --password *adminpassword* *domain*

        See the admin guide, included with the installer for more information on the parameters to `adjoin`.
        You should run `adcheck [domain]` on each machine to make sure that it meets the agent pre-requisites. You may need to write your own wrapper for
        this, as the `adcheck` command returns different codes, that you may want to interpret as success.

        Variables:
        
        TGZ_PATH: An absolute path to a downloaded copy of Centrify DirectControl for Mac from the Centrify Support Portal (tgz version).
        VERSION:  The DirectControl version number, used when packaging. (The version number is not automatically determined yet).
        NAME:     Base package name, defaults to CentrifyDC
        PLATFORM: (Unused) Will be used to identify the dmg filename, currently not used.

        Caveats:

        Version is not determined (best location pkgroot/centrifydc.pkg/PackageInfo, pkg-info bundle id=com.centrify.CentrifyDC CFBundleShortVersionString)
        adcheck isnt included in the install condition?
        Detect minimum OS from original flat package, this is scripted so unsure about methodology.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.pkg.CentrifyDC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CentrifyDC</string>
        <key>VERSION</key>
        <string>5.1.3</string>
        <key>PLATFORM</key>
        <string>mac10.7</string>
        <key>TGZ_PATH</key>
        <string>/Users/Shared/centrify-suite-2014-mac10.7.tgz</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%TGZ_PATH%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%VERSION%-%PLATFORM%.dmg/%NAME%-%VERSION%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%VERSION%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%VERSION%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Resources/display-popup.sh</string>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Resources/open_adjoin.sh</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/CentrifyDC.pkg</string>
                <key>source_flatpkg_dir</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
