<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        This recipe unpacks the Centrify DirectControl package, and modifies it (per the admin guide `Installing via ARD`) to exclude interactive scripts.
        
        The option to include a userscript to join a domain is not available. You should probably put it into a separate postinstall_script, or client management system script. This way you can alter the adjoin options without rebuilding the entire package. This also ensures that you keep application installation and system configuration separated.

        You should run `adcheck [domain]` on each machine to make sure that it meets the agent pre-requisites. A script to do that is not currently included.

        Variables:
        
        TGZ_PATH: An absolute path to a downloaded copy of Centrify DirectControl for Mac from the Centrify Support Portal.
        VERSION: The DirectControl version number, used when packaging. (The version number is not automatically determined yet).
        NAME: Base package name, defaults to CentrifyDC
        PLATFORM: (Unused) Will be used to identify the dmg filename, currently not used.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.pkg.CentrifyDC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CentrifyDC</string>
        <key>VERSION</key>
        <string>5.1.3</string>
        <key>PLATFORM</key>
        <string>mac10.7</string>
        <key>TGZ_PATH</key>
        <string>/Users/Shared/centrify-suite-2014-mac10.7.tgz</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%TGZ_PATH%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%VERSION%-%PLATFORM%.dmg/%NAME%-%VERSION%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%VERSION%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%VERSION%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Resources/display-popup.sh</string>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Resources/open_adjoin.sh</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%VERSION%</string>
                    <key>pkgtype</key>
                    <string>flat</string>
                    <key>id</key>
                    <string>com.github.mosen.CentrifyDC.pkg</string>
                    <key>resources</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot/Resources</string>
                    <key>version</key>
                    <string>%VERSION%</string>
                    <key>chown</key>
                    <array>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
