<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        Import the CentrifyDC silent install package into munki.

    </string>
    <key>Identifier</key>
    <string>com.github.mosen.munki.CentrifyDC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CentrifyDC</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>support/Centrify</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>AD Check</string>
                <string>AD Join Assistant</string>
                <string>AD Password Check</string>
                <string>Smart Card Assistant</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Centrify for Macintosh provides Active Directory-based authentication, single sign-on and 
                group policy support for the Macintosh platform.</string>
            <key>display_name</key>
            <string>Centrify for Macintosh</string>
            <key>minimum_os_version</key>
            <string>10.7.2</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>notes</key>
            <string>You should verify that adcheck passes before installing this package. You may want to use adjoin to join a domain afterwards.</string>
            <key>RestartAction</key>
            <string>RecommendRestart</string>
            <key>unattended_install</key>
            <true/>
            <key>uninstall_method</key>
            <string>/usr/share/centrifydc/bin/uninstall.sh</string>
            <key>uninstallable</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.pkg.CentrifyDC</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/CentrifyDC.pkg</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>        
    </array>
</dict>
</plist>
