<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        Download the most recent version of Centrify DirectControl for Mac (.tgz package)

        In order to do this you must have a legitimate support portal login, whether it is an evaluation or
        you have purchased centrify products.

        This is currently broken because we need a session to get the downloads url.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.CentrifyDC</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CentrifyDC</string>
        <key>CENTRIFY_DOWNLOAD_URL</key>
        <string>https://www.centrify.com/support/download.asp?asset=</string>
        <key>SUPPORT_CENTER_URL</key>
        <string>https://www.centrify.com/support/mac-support-center.asp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SUPPORT_CENTER_URL%</string>
                <key>re_pattern</key>
                <string>download\.asp\?(asset=centrify-suite[^"]*)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%CENTRIFY_DOWNLOAD_URL%%match%</string>
                <key>filename</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
