<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        This recipe unpacks the Centrify DirectControl package, and modifies it (per the admin guide) to exclude interactive scripts.
        You also have the option of running `adjoin` in the postinstall, although you may want to do this using your configuration management
        system rather than a package.

    </string>
    <key>Identifier</key>
    <string>com.github.mosen.pkg.DirectControlMac</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DirectControlMac</string>
        <key>AUTOJOIN_DOMAIN</key>
        <string></string>
        <key>AUTOJOIN_PASSWORD</key>
        <string></string>
        <key>VERSION</key>
        <string>5.1.3</string>
        <key>PLATFORM</key>
        <string>mac10.7</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.DirectControlMac</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%destination_path%/CentrifyDC-%VERSION%-%PLATFORM%.dmg/CentrifyDC-%VERSION%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/CentrifyDC-%VERSION%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/CentrifyDC-%VERSION%.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
    </array>
</dict>
</plist>
