<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Firefox disk image and builds a package, injecting a policies.json file as "distribution"

            Place the policies.json in the same directory as the recipe. You may optionally use a different name
            by setting POLICIES_FILENAME.

            Values for RELEASE correspond to directories here:
            http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
            Some useful values are:
            'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
            LOCALE corresponds to directories at
            http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$FIREFOX_BUILD/mac/
            Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'

            No idea if all Firefox builds are available in all the same localizations,
            so you may need to verify that any particular combination is offered.

            Adapted from FirefoxAutoconfig.pkg.recipe by Greg Neagle
        </string>
        <key>Identifier</key>
        <string>com.github.mosen.pkg.FirefoxESRPolicies</string>
        <key>Input</key>
        <dict>
            <key>RELEASE</key>
            <string>latest</string>
            <key>LOCALE</key>
            <string>en_US</string>
            <key>NAME</key>
            <string>Firefox</string>
            <key>POLICIES_FILENAME</key>
            <string>policies.json</string>
            <key>ORG_NAME</key>
            <string>Customized</string>
            <key>PKG_ID</key>
            <string>org.mozilla.firefox.pkg</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.download.firefox-rc-en_US</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>dmg_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>AppDmgVersioner</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                    </dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/Firefox.app</string>
                    <key>source_path</key>
                    <string>%pathname%/Firefox.app</string>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_DIR%/%POLICIES_FILENAME%</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/Firefox.app/Contents/Resources/distribution/policies.json</string>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>group</key>
                                <string>admin</string>
                                <key>path</key>
                                <string>Applications</string>
                                <key>user</key>
                                <string>root</string>
                            </dict>
                        </array>
                        <key>id</key>
                        <string>%PKG_ID%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                    </dict>
                    <key>pkgname</key>
                    <string>%NAME%_%ORG_NAME%-%version%</string>
                </dict>
                <key>Processor</key>
                <string>PkgCreator</string>
            </dict>
        </array>
    </dict>
</plist>