<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Downloads Adobe Application Manager Enterprise Edition
    http://www.adobe.com/devnet/creativesuite/enterprisedeployment.html

    The URL is static until i write a scraper.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.AAMEE</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AAMEE</string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.macromedia.com/pub/developer/creativesuite/AAMEE/mac/ApplicationManagerEnterprise_3_1_all.dmg</string>
        <key>DOWNLOAD_V2_URL</key>
        <string>https://download.macromedia.com/pub/developer/creativesuite/AAMEE/mac/ApplicationManagerEnterprise_2_1_all.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
