<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>ParentRecipe</key>
        <string>com.github.mosen.download.Adobe.AcrobatDC</string>
        <key>Description</key>
        <string>
            Customize Acrobat DC using the Acrobat DC Customization Wizard.

            Based on a script by timsutton.
        </string>
        <key>Identifier</key>
        <string>com.github.mosen.pkg.Adobe.AcrobatDCCustomized</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Adobe_Acrobat_DC_Customized</string>
        </dict>
    </dict>
</plist>