<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Adobe Acrobat Pro DC (Continuous) Enterprise installer
as provided at https://helpx.adobe.com/acrobat/kb/acrobat-dc-downloads.html,
uses the Customization Wizard for DC to output a customized installer package,
and imports the result into Munki.


ENABLE_BROWSER_PLUGIN can be set to any value to enable the Adobe Acrobat Pro
NPAPI browser plugin
</string>
    <key>Identifier</key>
    <string>com.github.timsutton.munki.adobe-acrobat-pro-base-customized</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/AdobeAcrobatPro</string>
        <key>NAME</key>
        <string>AdobeAcrobatPro</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.timsutton.pkg.adobe-acrobat-pro-base-customized</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>installs_item_paths</key>
                <array>
                    <string>/Applications/Adobe Acrobat %MAJOR_VERSION%/Adobe Acrobat.app</string>
                </array>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/unpack/root</string>
            </dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%output_pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
