<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads Adobe e-Learning Assets for Captivate 2017</string>
        <key>Identifier</key>
        <string>com.github.mosen.download.Adobe.eLearningAssets</string>
        <key>Input</key>
        <dict>
            <key>DOWNLOAD_URL</key>
            <string>http://www.adobe.com/go/Cp2017_mac_assets_installer</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
