<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Downloads Adobe Customization Wizard XI

    The URL is static until i write a scraper.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.CustomizationWizardXI</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CustomizationWizardXI</string>
        <key>DOWNLOAD_URL</key>
        <string>http://ardownload.adobe.com/pub/adobe/acrobat/mac/11.x/11.0.00/misc/AdobeCustomizationWizard11000.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
