<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest update for the specified major release of Lightroom</string>
    <key>Identifier</key>
    <string>com.github.mosen.download.Lightroom</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Lightroom</string>
        <key>VERSION</key>
        <string>5</string>
        <key>PLATFORM</key>
        <string>mac</string>
        <key>LANG</key>
        <string>en</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>LightroomURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>major_version</key>
                <string>5</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
