<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Downloads the current release version of the FontExplorer X Server (Mac)

    Includes installers for all platforms of the client, too.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.FontExplorerXServer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FontExplorerXServer</string>
        <key>DOWNLOAD_URL</key>
        <string>https://fex.linotype.com/download/server/FontExplorerXServer.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>FontExplorerX Server is no longer available for download (details: https://www.fontexplorerx.com/). This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
