<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
        Package FontExplorer X Pro Plugins as Separate Installable Packages.

        Individual plugins are unzipped, then the QT framework components are added to them from the libqt.zip included
        in the plugin bundle. These are made into stand alone packages.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.pkg.FontExplorerXPluginPS2014</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FontExplorerXPluginPS2014</string>
        <key>PKGID</key>
        <string>com.github.autopkg.mosen-recipes.fontexplorerxplugins.ps2014</string>
        <key>PLUGIN_BUNDLE_CONTENTS</key>
        <string>PlugIns.bundle/Contents/Resources</string>
        <key>PLUGIN_ARCHIVE_NAME</key>
        <string>FontExplorer X for Photoshop CC 2014.plugin.zip</string>
        <key>PLUGIN_NAME</key>
        <string>FontExplorer X for Photoshop CC 2014.plugin</string>
        <key>PLUGIN_INSTALL_DIR</key>
        <string>/Applications/Adobe Photoshop CC 2014/Plug-ins</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.FontExplorerXProPlugins</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%PLUGIN_BUNDLE_CONTENTS%/%PLUGIN_ARCHIVE_NAME%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_root/%PLUGIN_INSTALL_DIR%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_root/%PLUGIN_INSTALL_DIR%/%PLUGIN_NAME%/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%PLUGIN_BUNDLE_CONTENTS%/libqt.zip</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/libqt</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/libqt/QtCore.framework</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_root/%PLUGIN_INSTALL_DIR%/%PLUGIN_NAME%/Contents/Frameworks/QtCore.framework</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/libqt/QtGui.framework</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg_root/%PLUGIN_INSTALL_DIR%/%PLUGIN_NAME%/Contents/Frameworks/QtGui.framework</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_root</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%PKGID%</string>
                    <key>pkgname</key>
                    <string>%NAME%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>chown</key>
                    <array>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
