<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Download FontExplorer X Pro Plugins as a separate package (plugins-xyz.zip).
    Plugins are already included in the FontExplorerXPro recipe. 
    Only use this if you want to alter the way that plugins are installed.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.FontExplorerXPro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FontExplorerXProPlugins</string>
        <key>FEED_URL</key>
        <string>http://fex.linotype.com/update/client/mac/pro/plugins-4/appcast-small.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%FEED_URL%</string>
                <key>appcast_query_pairs</key>
                <dict>
                    <key>language</key>
                    <string>en</string>
                    <key>FontExplorerXProBundleVersion</key>
                    <string>10505</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
