<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Re-packs the Art Files 2 zip into a dmg, and imports into munki.

    The download URL has a dmg extension but redirects to a zip archive containing an app bundle.
    The recipe will unpack the zip file, and then create a DMG for the .app. This is imported into munki and
    will be installed as a CopyFromDmg style package.
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.munki.ArtFiles2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ArtFiles2</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/CodeLine</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Art Files</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Art Files is a stand-alone application that takes the tedious task of collecting Illustrator documents, linked images and fonts for graphics files and turns it into a simple point &amp; click operation. Art Files focuses on gathering just the information you need to get your files packaged up or ready for archiving.</string>
            <key>display_name</key>
            <string>Art Files</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mosen.download.ArtFiles2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
